controllers/EmpAccountManageController.php

    public function actionEmpAccountEmailCheck(){
        $email = yii::$app->request->post('email');
        if (!empty($email)) {
            $Employermodel = new Employer();
            $countemp = $Employermodel->find()
                ->where([
                    'emp_email' => $email,
                    'emp_identity_bind_email' => 101
                ])
                ->andWhere(['<>','id',yii::$app->employer->identity->id])
                ->count();
            $Engineermodel = new Engineer();
            $counteng = $Engineermodel->find()
                ->where([
                    'eng_email' => $email,
                    'eng_identity_bind_email' => 101
                ])
                ->count();
---
SELECT COUNT(*) FROM `dp_employer` WHERE ((`emp_email`='richard.sun@jeendon.com') AND (`emp_identity_bind_email`=101)) AND (`id` <> '68')
SELECT COUNT(*) FROM `dp_engineer` WHERE (`eng_email`='richard.sun@jeendon.com') AND (`eng_identity_bind_email`=101)