controllers/EmpOrderManageController.php

SELECT COUNT(*) FROM `dp_spare_parts` WHERE (`task_order_id`='231') AND (`task_status`=106)
---
        //查询待确认的任务总数
        if(!empty($conductingorders)){
            foreach ($conductingorders as $i => &$conductingorder){
                $conductingorder['pendingconfirmnum'] = SpareParts::find()
                    ->where(
                        [
                            'task_order_id' => $conductingorder['order_id'],
                            'task_status' => 105,
                        ]
                    )
                    ->count();

SELECT * FROM `dp_order` WHERE `order_id`='231'
---
            }
            $Ordermodel = new Order();
            if($Ordermodel->OrderCheck($select, $post['order_id'], $totalmoney)){
                $order = Order::find()->where(['order_id' => $post['order_id']])->asArray()->one();

SELECT COUNT(*) FROM `dp_order` WHERE (`order_employer_id`='72') AND (`order_status`=103) AND (`order_id`='231')
---
    public function actionEmpConductingOrderDetail(){
        $order_id = yii::$app->request->get('order_id');
        //判断订单是否为该工程师所有
        $Ordermodel = new Order();
        $emp_id = yii::$app->employer->id;
        $count = $Ordermodel->find()
            ->where([
                'order_employer_id' =>$emp_id,
                'order_status' => 103,
                'order_id' => $order_id
            ])
            ->count();