controllers/EngOrderManageController.php

SELECT COUNT(*) FROM `dp_offer` WHERE (`offer_id`='452') AND (`offer_eng_id`='47')
---
    public function actionEngOrderConductingOfferDetail($offer_id){
        //判断当前offerid是否为当前登陆账户所有
        $count = Offer::find()->where(['offer_id' => $offer_id, 'offer_eng_id' => yii::$app->engineer->id])->count();

SELECT COUNT(*) FROM `dp_bind_alipay` WHERE (`bind_user_id`='47') AND (`bind_alipay_type`=1)
---

        //判断是否绑定银行卡
        $BindAlipaymodel  = new BindAlipay();
        $bindbankcardcount = $BindAlipaymodel->find()
            ->where(
                [
                    'bind_user_id' => yii::$app->engineer->id,
                    'bind_alipay_type' => 1
                ]
            )
            ->count();

SELECT `dp_bind_alipay`.*, `dp_appliy_payment_money`.* FROM `dp_appliy_payment_money` LEFT JOIN `dp_bind_alipay` ON `dp_appliy_payment_money`.apply_bind_bank_card_id = `dp_bind_alipay`.bind_alipay_id WHERE (`apply_money_task_id`='211') AND (`apply_money_eng_id`='47') AND (`apply_money_apply_type`=1)
SELECT `dp_bind_alipay`.*, `dp_appliy_payment_money`.* FROM `dp_appliy_payment_money` LEFT JOIN `dp_bind_alipay` ON `dp_appliy_payment_money`.apply_bind_bank_card_id = `dp_bind_alipay`.bind_alipay_id WHERE (`apply_money_task_id`='211') AND (`apply_money_eng_id`='47') AND (`apply_money_apply_type`=2)
SELECT `dp_debitrefund`.*, `dp_admin`.username FROM `dp_debitrefund` LEFT JOIN `dp_admin` ON `dp_admin`.id = `dp_debitrefund`.debitrefund_examine_id WHERE `debitrefund_task_id`='211'
SELECT * FROM `dp_demand_release_file` WHERE `drf_order_number`='CL2017070222032512'
---

        //获取工程师提交的80%款费申请
        $AppliyPaymentMoneymodel = new AppliyPaymentMoney();
        $appliypaymentmoney80 = $AppliyPaymentMoneymodel->find()
            ->select(['{{%bind_alipay}}.*', '{{%appliy_payment_money}}.*'])
            ->where(
                [
                    'apply_money_task_id' => $offer['task_id'],
                    'apply_money_eng_id' => yii::$app->engineer->id,
                    'apply_money_apply_type' => 1
                ]
            )
            ->join('LEFT JOIN', '{{%bind_alipay}}', '{{%appliy_payment_money}}.apply_bind_bank_card_id = {{%bind_alipay}}.bind_alipay_id')
            ->asArray()
            ->one();
        //获取工程师提交的20%款费申请
        $appliypaymentmoney20 = $AppliyPaymentMoneymodel->find()
            ->select(['{{%bind_alipay}}.*', '{{%appliy_payment_money}}.*'])
            ->where(
                [
                    'apply_money_task_id' => $offer['task_id'],
                    'apply_money_eng_id' => yii::$app->engineer->id,
                    'apply_money_apply_type' => 2
                ]
            )
            ->join('LEFT JOIN', '{{%bind_alipay}}', '{{%appliy_payment_money}}.apply_bind_bank_card_id = {{%bind_alipay}}.bind_alipay_id')
            ->asArray()
            ->one();

        //获取雇主提交的扣款退款申请
        $debitrefund = Debitrefund::find()
            ->select(['{{%debitrefund}}.*', '{{%admin}}.username'])
            ->where(
                [
                    'debitrefund_task_id' => $offer['task_id']
                ]
            )
            ->join('LEFT JOIN', '{{%admin}}', '{{%admin}}.id = {{%debitrefund}}.debitrefund_examine_id')
            ->asArray()
            ->one();
        //获取雇主上传接口上传文件信息
        $DemandReleaseFilemodel = new DemandReleaseFile();
        $DemandReleaseFiles = $DemandReleaseFilemodel->find()
            ->where(['drf_order_number' => $offer['order_number']])
            ->asArray()
            ->all();

SELECT * FROM `dp_procedure` WHERE `task_part_id`='211'
---

        //查询订单队对应的任务信息列表
        $Proceduremodel = new Procedure();
        $Proceduremodel = $Proceduremodel->find()
            ->where([
                'task_part_id' => $offer['task_id'],
            ]);