controllers/PayController.php

    public function actionEmpPay()
    {
        try{
            $order_id = Yii::$app->request->post('order_id');
            $paymethod = Yii::$app->request->post('PayType');
            if (empty($order_id) || empty($paymethod)) {
                throw new Exception("order message is error");
            }
            $count = Order::find()->where(['order_id' => $order_id, 'order_employer_id' => Yii::$app->employer->id])->count();
            if($count != 1){
                throw new Exception("order_id is error");
            }
            //验证支付信息
            $count = SpareParts::find()
                ->where(
                    [
                        'task_order_id' => $order_id
                    ]
                )
                ->join('LEFT JOIN', '{{%offer}}', '{{%spare_parts}}.task_offer_id = {{%offer}}.offer_id')
                ->join('LEFT JOIN', '{{%engineer}}', '{{%engineer}}.id = {{%offer}}.offer_eng_id')
                ->andWhere(
                    [
                        'eng_status' => 2,
                        'eng_examine_type' => 1
                    ]
                )
                ->count();
---
SELECT COUNT(*) FROM `dp_order` WHERE (`order_id`='231') AND (`order_employer_id`='72')
SELECT COUNT(*) FROM `dp_spare_parts` LEFT JOIN `dp_offer` ON `dp_spare_parts`.task_offer_id = `dp_offer`.offer_id LEFT JOIN `dp_engineer` ON `dp_engineer`.id = `dp_offer`.offer_eng_id WHERE (`task_order_id`='231') AND (`eng_status`=2)

    public function BalanceReturn($order_id, $result)
    {
        $order = Order::find()
            ->where(
                [
                    'order_id' => $order_id
                ]
            )
            ->asArray()
            ->one();
---
SELECT * FROM `dp_order` WHERE `order_id`='231'