controllers/SiteController.php

SELECT * FROM `dp_engineer` WHERE (`eng_examine_status`=103) AND (`eng_recommend_status`=101) LIMIT 6
---
    public function actionIndex()
    {
	    $query = new\yii\db\Query();
        $Taskmodel = new Task();
        $query = new\yii\db\Query();
        $tasks = $query->select(['{{%order}}.*', '{{%spare_parts}}.*'])
            ->from('{{%spare_parts}}')
            ->join('inner JOIN', '{{%order}}', '{{%order}}.order_id = {{%spare_parts}}.task_order_id')
            ->where(
                [
                    'order_status' => [101, 102 ,103 , 104],
                    'task_status' => [101, 102, 103, 104, 105, 106, 107,111],
                ]
            )
            ->limit(31)
            ->orderBy(
                [
                    'order_id' => SORT_ASC,
                    'order_add_time' => SORT_DESC,
                ]
            )
            ->all();

        //获取推荐工程师
        $Engineermodel = new Engineer();
        $Engineermodel = $Engineermodel->find()
            ->where([
               'eng_examine_status' => 103,
               'eng_recommend_status' => 101,
            ]);

SELECT `dp_news_column`.*, `dp_news`.* FROM `dp_news` LEFT JOIN `dp_news_column` ON `dp_news_column`.news_column_id = `dp_news`.news_column WHERE (`news_column_show`=1) AND (`news_column`=15) ORDER BY `news_addtime` DESC LIMIT 5
---

        //获取平台资讯
        $newsmodel  =  new News();
        $newsplatforms = $newsmodel->find()->orderBy('news_addtime Desc')
            ->select(
                [
                    '{{%news_column}}.*',
                    '{{%news}}.*',
                ]
            )
            ->where(
                [
                    'news_column_show' => 1,
                    'news_column' => 15,
                ]
            )
            ->join('LEFT JOIN', '{{%news_column}}', '{{%news_column}}.news_column_id = {{%news}}.news_column')
            ->limit(5)
            ->orderBy(
                [
                    'news_addtime' => SORT_DESC,
                ]
            )
            ->asArray()
            ->all();

SELECT `dp_news_column`.*, `dp_news`.* FROM `dp_news` LEFT JOIN `dp_news_column` ON `dp_news_column`.news_column_id = `dp_news`.news_column WHERE (`news_column_show`=1) AND (`news_column`=16) ORDER BY `news_addtime` DESC LIMIT 10
SELECT COUNT(*) FROM `dp_employer`
SELECT COUNT(*) FROM `dp_engineer`
SELECT SUM(eng_member_num) FROM `dp_engineer` WHERE `eng_examine_type` IN (2, 3)
---

        //获取行业快讯
        $newsmodel  =  new News();
        $newsindustrys = $newsmodel->find()
            ->select(
                [
                    '{{%news_column}}.*',
                    '{{%news}}.*',
                ]
            )
            ->where(
                [
                    'news_column_show' => 1,
                    'news_column' => 16,
                ]
            )
            ->join('LEFT JOIN', '{{%news_column}}', '{{%news_column}}.news_column_id = {{%news}}.news_column')
            ->limit(10)
            ->orderBy(
                [
                    'news_addtime' => SORT_DESC,
                ]
            )
            ->asArray()
            ->all();

        $employercount = Employer::find()
            ->count();
        $engineercount1 = Engineer::find()
            ->count();
        $engineercount3 = Engineer::find()
            ->where([
                'eng_examine_type' => [2, 3],
            ])
            ->sum('eng_member_num');

SELECT * FROM `dp_employer` WHERE (`username`='15221382801') OR (`emp_phone`='15221382801')
SELECT * FROM `dp_engineer` WHERE (`username`='15221382801') OR (`eng_phone`='15221382801')
---
    public function actionLogin()
    {
        $this->layout = "main-site";
        //获取上一次的连接
        if(yii::$app->request->isPost){
            $username = yii::$app->request->post('username');
            $password = yii::$app->request->post('password');
            if(empty($username) || empty($password)) {
                return $this->error('用户名密码不能为空');
            }
            $Employermodel = new Employer();
            $employer = $Employermodel->find()
                ->where(['or',
                    ['username' => $username],
                    ['emp_phone' => $username],
                ])
                ->one();
            $Engineermodel = new Engineer();
            $engineer = $Engineermodel->find()
                ->where(['or',
                    ['username' => $username],
                    ['eng_phone' => $username],
                ])
                ->one();