widgets/FooterWidget.php

    public function init()
    {
        $RuleTypemodel = new RuleType();
        $ruletypes = $RuleTypemodel->find()
            ->where(['ruletype_show' => 1])
            ->orderBy('ruletype_order ASC')
            ->asArray()
            ->all();

        if(!empty($ruletypes)){
            foreach($ruletypes as $i => &$ruletype){
                $rules = Rules::find()
                    ->where(
                        [
                            'rules_show' => 1,
                            'rules_ruletype_id' => $ruletype['ruletype_id'],
                        ]
                    )
                    ->orderBy('rules_order ASC')
                    ->asArray()
                    ->all();
---
SELECT * FROM `dp_rule_type` WHERE `ruletype_show`=1 ORDER BY `ruletype_order`
SELECT * FROM `dp_rules` WHERE (`rules_show`=1) AND (`rules_ruletype_id`='4') ORDER BY `rules_order`