widgets/PlatWidget.php

SELECT * FROM `dp_platform` WHERE `platform_show`=1
---
    public function init()
    {
        $Platformmodel = new Platform();
        $platforms = $Platformmodel->find()
            ->where(['platform_show' => 1])
            ->asArray()
            ->all();