widgets/RecommendEngineerWidget.php

SELECT * FROM `dp_engineer` WHERE (`eng_examine_status`=103) AND (`eng_recommend_status`=101) LIMIT 6
---
    public function run()
    {
        //获取订单的信息
        $query = new\yii\db\Query();
        if(!empty($this->order_id)){
            $task = $query->select(['{{%order}}.*', '{{%spare_parts}}.*'])
                ->from('{{%spare_parts}}')
                ->join('LEFT JOIN', '{{%order}}', '{{%order}}.order_id = {{%spare_parts}}.task_order_id')
                ->where(['order_id' => $this->order_id])
                ->one();
            //判断订单类型（结构|工艺）

            $Engineermodel = new Engineer();
            $Engineermodel = $Engineermodel->find()
                ->where([
                    'eng_examine_status' => 103,
                    'eng_recommend_status' => 101
                ]);

            $engineers = $Engineermodel
                ->limit(yii::$app->params['configure']['eng_number'])
                ->asArray()
                ->all();
            $flag = 1;
            //匹配算法设计
        }else{
            $Engineermodel = new Engineer();
            $Engineermodel = $Engineermodel->find()
            ->where([
                'eng_examine_status' => 103,
                'eng_recommend_status' => 101
            ]);