<?php
/**
 * Created by PhpStorm.
 * User: lihongxing
 * Date: 2016/9/5
 * Time: 13:54
 */
namespace app\common\core;

use yii;

class ConstantHelper
{

    /**
     * 需提交的成果
     * 结构类
     */
    public static $structure_order_achievements = [
        'data' => [
            '101' => '结构图纸3D',
            '102' => '结构图纸2D',
            '103' => '单件图',
            '104' => 'BOM表',
        ],
        'default' => '',
        'type' => '1'

    ];

    public static $order_achievements = [
        'data' => [
            '101' => '三维工艺图纸',
            '102' => '二维工艺图纸',
            '103' => '拉延面CAE分析',
            '104' => '全工序CAE分析',
            '105' => '结构图纸3D',
            '106' => '结构图纸2D',
            '107' => '单件图',
            '108' => 'BOM表',
        ],
        'default' => '',
        'type' => '1'

    ];

    /**
     * 需提交的成果
     * 工艺类
     */
    public static $technics_order_achievements = [
        'data' => [
            '101' => '三维工艺图纸',
            '102' => '二维工艺图纸',
            '103' => '拉延面CAE分析',
            '104' => '全工序CAE分析',

        ],
        'default' => '',
        'type' => '1'
    ];

    /**
     * 是否参数化
     */
    public static $order_whether_parameter = [
        'data' => [
            '101' => '是',
            '102' => '否',
        ],
        'default' => '102',
        'type' => '2'
    ];

    /**
     * 是否参数化
     */
    public static $order_whether_invoice = [
        'data' => [
            '101' => '是',
            '102' => '否',
        ],
        'default' => '102',
        'type' => '2'
    ];

    /**
     * 设计软件，软件版本
     * 结构类
     */
    public static $order_design_software_version = [
        'UG NX' => [
            'data' => ['UG NX 2.0', 'UG NX 4.0', 'UG NX 5.0', 'UG NX 6.0', 'UG NX 7.0', 'UG NX 8.0', 'UG NX 9.0', 'UG NX 10.0'],
            'default' => ''
        ],
        'CATIA' => [
            'data' => ['CATIA V5R16', 'CATIA V5R17', 'CATIA V5R18', 'CATIA V5R19', 'CATIA V5R20', 'CATIA V5R21', 'CATIA V6R2012', 'CATIA V6R2013', 'CATIA V6R2015'],
            'default' => ''
        ],
        'AUTOCAD' => [
            'data' => ['AUTOCAD 2004', 'AUTOCAD 2007', 'AUTOCAD 2008', 'AUTOCAD 2010', 'AUTOCAD 2014', 'AUTOCAD 2016'],
            'default' => ''
        ],
        'AUTOFORM' => [
            'data' => ['AUTOFORM 4.0', 'AUTOFORM 4.3', 'AUTOFORM 5.2', 'AUTOFORM 6'],
            'default' => ''
        ],
        'DYNAFORM' => [
            'data' => ['DYNAFORM 5.6', 'DYNAFORM 5.7', 'DYNAFORM 5.8', 'DYNAFORM 5.9'],
            'default' => ''
        ],
    ];

    public static  $type_of_engineer =
    [
        1=>'结构工程师',
        2=>'工艺工程师',
    ];
    public static  $eng_practitioners_years =
    [
        0 => '无经验',
        1 => '1年',
        2 => '2年',
        3 => '3年',
        5 => '5年',
        6 => '6年',
        7 => '7年',
        8 => '8年',
        9 => '9年',
        10 => '10年',
        11 => '11年',
        12 => '12年',
        13 => '13年',
        14 => '14年',
        15 => '15年',
        16 => '16年',
        17 => '17年',
        18 => '18年',
        19 => '19年',
        20 => '20年',
        21 => '21年',
        22 => '22年',
        23 => '23年',
        24 => '24年',
        25 => '25年',
        26 => '26年',
        27 => '27年',
        28 => '28年',
        29 => '29年',
        30 => '30年',
        31 => '30年及以上',
    ];
    public static  $eng_brands =
        [
            0 => '（东风）本田',
            1 => '（广汽）本田',
            2 => '本田（国外）',
            3 => '（华晨）宝马',
            4 => '宝马（国外）',
            5 => '（北京）奔驰',
            6 => '（福建）奔驰',
            7 => '奔驰（国外）',
            8 => '（东风）标致',
            9 => '比亚迪',
            10 => '北京汽车',
            11 => '长安汽车',
            12 => '长城汽车',
            13 => '昌河汽车',
            14 => '成功汽车',
            15 => '长城华冠',
            16 => '长丰猎豹',
            17 => '（上汽）大众',
            18 => '（一汽）大众',
            19 => '大众（国外）',
            20 => '东风乘用车',
            21 => '东南汽车',
            22 => '（上汽）大通',
            23 => '（广汽）丰田',
            24 => '（一汽）丰田',
            25 => '丰田（国外）',
            26 => '（长安）福特',
            27 => '福特（国外）',
            28 => '（北汽）福田',
            29 => '（广汽）菲克',
            30 => '福迪汽车',
            31 => '观致汽车',
            32 => '广汽汽车',
            33 => '海马汽车',
            34 => '华泰汽车',
            35 => '华普汽车',
            36 => '华晨汽车',
            37 => '华瑞汽车',
            38 => '黄海汽车',
            39 => '悍马汽车',
            40 => '哈飞汽车',
            41 => '江铃汽车',
            42 => '（广汽）吉奥',
            43 => '吉利汽车',
            44 => '江淮汽车',
            45 => '捷豹路虎',
            46 => '九龙汽车',
            47 => '（东风）雷诺',
            48 => '雷诺（国外）',
            49 => '（昌河）铃木',
            50 => '（长安）铃木',
            51 => '铃木（国外）',
            52 => '力帆汽车',
            53 => '莲花汽车',
            54 => '雷丁汽车',
            55 => '乐视汽车',
            56 => '（长安）马自达',
            57 => '（一汽）马自达',
            58 => '马自达（国外）',
            59 => '欧宝（国外）',
            60 => '(长安）PSA',
            61 => 'PSA（国外）',
            62 => '（东风悦达）起亚',
            63 => '奇瑞汽车',
            64 => '（东风）日产',
            65 => '（郑州）日产',
            66 => '日产（国外）',
            67 => '上海汽车',
            68 => '（东南）三菱',
            69 => '（广汽）三菱',
            70 => '双环汽车',
            71 => '陕汽重卡',
            72 => '（上汽）通用',
            73 => '通用（国外）',
            74 => '沃尔沃（国产）',
            75 => '沃尔沃（国外）',
            76 => '（上汽通用）五菱',
            77 => '五十铃',
            78 => '（北京）现代',
            79 => '川崎',
            80 => '现代（国外）',
            81 => '（东风）雪铁龙',
            82 => '雪铁龙（国外）',
            83 => '（福汽）新龙马',
            84 => '（北汽）银翔',
            85 => '（东风）裕隆',
            86 => '（天津）一汽',
            87 => '野马汽车',
            88 => '依维柯',
            89 => '一汽轿车',
            90 => '众泰汽车',
            91 => '中兴汽车',
            92 => '知豆电动车',
            93 => '中欧汽车',
            94 => '中顺汽车',
        ];
    /**
     * 工程师软件技能
     */
    public static  $design_software_skills =
    [
        'data' => [
            'UG NX' => 'UG NX',
            'CATIA' => 'CATIA',
            'AUTOCAD' => 'AUTOCAD',
            'AUTOFORM' => 'AUTOFORM',
            'DYNAFORM' => 'DYNAFORM',
        ]
    ];

    public static function get_engineer_conversion_chinese($items, $name ,$Separator)
    {
        $items = json_decode($items);
        foreach($items as $key => $item)
        {
            if($key == 0){
                $val = self::${$name}['data'][$item];
            }else{
                $val = $val . $Separator .self::${$name}['data'][$item];
            }
        }
        return $val;

    }
    /**
     * 返回值
     * @param  Array $keys 选中数据信息
     * @param  String $name
     * @param  Int $display
     * @return String OR Array
     */
    public static function get_order_byname($keys, $name, $type, $display = 1)
    {
        if(strstr((string)$keys,",")){
            $keys =explode(',',$keys);
        }else{
            $keys = [$keys];
        }
        if($type == 1){
            $arr = [];
            foreach ($keys as $key => $item) {
                if($name == 'order_design_software_version'){
                    $arr = $keys;
                }else{
                    $arr[$item] = self::${$name}['data'][$item];
                }
            }
            return $arr;
        }else{
            $val = '';
            foreach ($keys as $key => $item) {
                if($name == 'order_design_software_version'){
                    if($display == 1){
                        if($key == 0){
                            $val = $item;
                        }else{
                            $val = $val . ' <br> ' .$item;
                        }

                    }else{
                        if($key == 0){
                            $val = $item;
                        }else{
                            $val = $val . ' | ' .$item;
                        }
                    }
                }else{
                    if($display == 1){
                        if($key == 0){
                            $val = self::${$name}['data'][$item];
                        }else{
                            $val = $val . ' <br> ' .self::${$name}['data'][$item];
                        }
                    }else{
                        if($key == 0){
                            $val = self::${$name}['data'][$item];
                        }else{
                            $val = $val . ' | ' .self::${$name}['data'][$item];
                        }
                    }
                }
            }
            return $val;
        }
    }

    /**
     * 车厂体系
     */
    public static $order_parking_system = [
        'data' => [
            '101' => '（东风）本田',
            '102' => '（广汽）本田',
            '103' => '本田（国外）',
            '104' => '（华晨）宝马',
            '105' => '宝马（国外）',
            '106' => '（北京）奔驰',
            '107' => '（福建）奔驰',
            '108' => '奔驰（国外）',
            '109' => '（东风）标致',
            '110' => '比亚迪',
            '111' => '北京汽车',
            '112' => '长安汽车',
            '113' => '长城汽车',
            '114' => '昌河汽车',
            '115' => '成功汽车',
            '116' => '长城华冠',
            '117' => '长丰猎豹',
            '118' => '（上汽）大众',
            '119' => '（一汽）大众',
            '120' => '大众（国外）',
            '121' => '东风乘用车',
            '122' => '东南汽车',
            '123' => '（上汽）大通',
            '124' => '（广汽）丰田',
            '125' => '（一汽）丰田',
            '126' => '丰田（国外）',
            '127' => '（长安）福特',
            '128' => '福特（国外）',
            '129' => '（北汽）福田',
            '130' => '（广汽）菲克',
            '131' => '福迪汽车',
            '132' => '观致汽车',
            '133' => '广汽汽车',
            '134' => '海马汽车',
            '135' => '华泰汽车',
            '136' => '华普汽车',
            '137' => '华晨汽车',
            '138' => '华瑞汽车',
            '139' => '黄海汽车',
            '140' => '悍马汽车',
            '141' => '哈飞汽车',
            '142' => '江铃汽车',
            '143' => '（广汽）吉奥',
            '144' => '吉利汽车',
            '145' => '江淮汽车',
            '146' => '捷豹路虎',
            '147' => '九龙汽车',
            '148' => '（东风）雷诺',
            '149' => '雷诺（国外）',
            '150' => '（昌河）铃木',
            '151' => '（长安）铃木',
            '152' => '铃木（国外）',
            '153' => '力帆汽车',
            '154' => '莲花汽车',
            '155' => '雷丁汽车',
            '156' => '乐视汽车',
            '157' => '（长安）马自达',
            '158' => '（一汽）马自达',
            '159' => '马自达（国外）',
            '160' => '欧宝（国外）',
            '161' => '(长安）PSA',
            '162' => 'PSA（国外）',
            '163' => '（东风悦达）起亚',
            '164' => '奇瑞汽车',
            '165' => '（东风）日产',
            '166' => '（郑州）日产',
            '167' => '日产（国外）',
            '168' => '上海汽车',
            '169' => '（东南）三菱',
            '170' => '（广汽）三菱',
            '171' => '双环汽车',
            '172' => '陕汽重卡',
            '173' => '（上汽）通用',
            '174' => '通用（国外）',
            '175' => '沃尔沃（国产）',
            '176' => '沃尔沃（国外）',
            '177' => '（上汽通用）五菱',
            '178' => '五十铃',
            '179' => '（北京）现代',
            '180' => '现代（国外）',
            '181' => '（东风）雪铁龙',
            '182' => '雪铁龙（国外）',
            '183' => '（福汽）新龙马',
            '184' => '（北汽）银翔',
            '185' => '（东风）裕隆',
            '186' => '（天津）一汽',
            '187' => '野马汽车',
            '188' => '依维柯',
            '189' => '一汽轿车',
            '190' => '众泰汽车',
            '191' => '中兴汽车',
            '192' => '知豆电动车',
            '193' => '中欧汽车',
            '194' => '中顺汽车',
        ],
        'default' => '',
        'type' => '2'
    ];
    /**
     * 零件类型
     * 结构类
     */
    public static $structure_task_part_type = [
        'data' => [
            '104' => '普板零件',
            '103' => '高强度零件',
            '105' => '侧围翼子板类',
            '101' => '四门三盖类',
            '107' => '底盘零件',
            '106' => 'ABC柱类',
            '102' => '纵梁类',
        ],
        'default' => '',
        'type' => '1'
    ];
    /**
     * 零件类型
     * 工艺类
     */
    public static $technics_task_part_type = [
        'data' => [
            '104' => '普板零件',
            '103' => '高强度零件',
            '105' => '侧围翼子板类',
            '101' => '四门三盖类',
            '107' => '底盘零件',
            '106' => 'ABC柱类',
            '102' => '纵梁类',
            '108' => '地板类',
        ],
        'default' => '',
        'type' => '1'
    ];
    /**
     * 模具类型
     */
    public static $task_mold_type = [
        'data' => [
            '101' => '铸造模',
            '102' => '钢板模',
            '103' => '简易模（铸造）',
            '104' => '简易模（钢板）',
        ],
        'default' => '',
        'type' => '1'
    ];
    /**
     * 生产方式
     */
    public static $task_mode_production = [
        'data'=>[
            '101' => '手工生产',
            '102' => '自动生产',
            '103' => '多工位',
            '104' => '级进模',
            ],
        'default' => '',
        'type' => '1'
    ];
    /**
     * 一模几件
     */
    public static $task_mold_pieces = [
        'data' => [
            '101' => '1件',
            '102' => '2件',
            '103' => '左右件',
            '104' => '4件',
        ],
        'default' => '',
        'type' => '1'
    ];
    /**
     * 工序别
     */
    public static $task_process_id = [
        'data'=>[
            '115' => 'PRG',
            '101' => 'OP05',
            '102' => 'OP10',
            '103' => 'OP20',
            '104' => 'OP30',
            '105' => 'OP40',
            '106' => 'OP50',
            '107' => 'OP60',
            '108' => 'OP70',
            '109' => 'OP80',
            '110' => 'OP90',
            '111' => 'OP100',
            '112' => 'OP110',
            '113' => 'OP120',
            '114' => 'OP130',
        ],
        'default' => '',
        'type' => '1'
    ];
    /**
     * 工序内容
     */
    public static $task_process_name = [
        'data'=>[
            '134' => '4工步',
            '119' => '5工步',
            '120' => '6工步',
            '121' => '7工步',
            '122' => '8工步',
            '123' => '9工步',
            '124' => '10工步',
            '125' => '11工步',
            '126' => '12工步',
            '127' => '13工步',
            '128' => '14工步',
            '129' => '15工步',
            '130' => '16工步',
            '131' => '17工步',
            '132' => '18工步',
            '133' => '19工步',
            '101' => 'BL',
            '110' => 'CUT',
            '118' => 'SEP',
            '103' => 'TR',
            '117' => 'CTR',
            '104' => 'PI',
            '111' => 'CPI',
            '114' => 'BEND',
            '102' => 'FO',
            '116' => 'DR(单动)',
            '109' => 'DR(双动)',
            '105' => 'RST',
            '112' => 'CRST',
            '106' => 'FL',
            '113' => 'CFL',
            '107' => 'BUR',
            '108' => 'HEM',
            '115' => 'ID',
            '135' => '多工位垫板',
            '136' => '多工位夹手',

        ],
        'default' => '',
        'type' => '1'
    ];
    /**
     * 压力源
     */
    public static $task_source_pressure = [
        'data'=>[
            '102' => '压机下气垫',
            '103' => '氮气缸',
            '104' => '刚性弹簧',
            '101' => '压机上滑块',
        ],
        'default' => '',
        'type' => '1'
    ];
    /**
     * 标准件标准
     */
    public static $order_part_standard = [
        'data'=>[
            '101' => '盘起',
            '102' => '三协',
            '103' => '三柱',
            '104' => '永茂',
            '105' => 'IEM',
            '106' => 'DADCO',
            '107' => 'FIBRO',
            '108' => '世茂',
        ],
        'default' => '',
        'type' => '1'
    ];


    /**
     * 招标持续天数
     */
    public static $order_bidding_period = [
        'data'=>[
            '101' => '2',
            '102' => '3',
            '103' => '4',
            '104' => '5',
            '105' => '6',
            '106' => '7',
        ],
        'default' => '',
        'type' => '1',
    ];

    public static $order_type = [
        'data'=>[
            '1' => '工艺',
            '2' => '结构',
        ],
        'default' => '101',
        'type' => '1'
    ];

    public static $order_eng_drawing_type = [
        'data'=>[
            '101' => '模具结构图纸',
            '102' => '模具工艺图纸',

        ],
        'default' => '',
        'type' => '1',
    ];

}

?>