models/DemandReleaseFile.php

INSERT INTO `dp_demand_release_file` (`drf_add_time`, `drf_name`, `drf_url`, `drf_order_number`) VALUES (1491209457, 'test.rar', '/attachement/doc/frontend/2017/04/03/2/e/9/3/58e20cf1abc56.rar', 'D2017040212442514')
---
    public function savereleasefile($info)
    {
        $this->setAttribute('drf_add_time', time());
        $this->setAttribute('drf_name', $info['name']);
        $this->setAttribute('drf_url', $info['attachment']);
        $this->setAttribute('drf_order_number', $info['order_number']);
        if($this->save()){