models/Employer.php

    public static function findByUsername($employername) {
        $Employer = Employer::find()->where(array('username' => $employername))->asArray()->one();
---
SELECT * FROM `dp_employer` WHERE `username`='Emp00072'

    public static function findById($id) {
        $Employer = Employer::find()->where(array('id' => $id))->asArray()->one();
---
SELECT * FROM `dp_employer` WHERE `id`='72'