models/Engineer.php

    public static function findById($id) {
        $Engineer = Engineer::find()->where(array('id' => $id))->asArray()->one();
---
SELECT * FROM `dp_engineer` WHERE `id`='47'