models/Order.php

    public function getOrderConductingDetailFrontend($order_id)
    {
        $query = new\yii\db\Query();
        $results = $query->select(['{{%order}}.*', '{{%employer}}.*'])
            ->from('{{%order}}')
            ->join('LEFT JOIN', '{{%employer}}', '{{%employer}}.id = {{%order}}.order_employer_id')
            ->where(['order_id' => $order_id])
            ->one();
        //查询订单队对应的任务信息列表
        $SparePartsmodel = new SpareParts();
        //获取订单包含的零件号
        $task_parts_ids = $SparePartsmodel->find()
            ->select(['task_parts_id'])
            ->where(
                [
                    'task_order_id' => $order_id,
                ]
            )
            ->groupBy('task_parts_id')
            ->asArray()
            ->all();
        $tasks = array();
        if (!empty($task_parts_ids)) {
            foreach ($task_parts_ids as $key => $item) {
                $taskemp = $SparePartsmodel->find()
                    ->select(['{{%spare_parts}}.*', '{{%task_cancellation_request}}.*'])
                    ->where(
                        [
                            'task_order_id' => $order_id,
                            'task_parts_id' => $item['task_parts_id'],
                        ]
                    )
                    ->andWhere(
                        [
                            'in', 'task_status', [103, 105, 104, 106, 110, 108,111,102] //103正常的进行中任务  108：未支付任务 110：进行中取消的任务 102:支付中的任务
                        ]
                    )
                    ->join('LEFT JOIN', '{{%task_cancellation_request}}', '{{%task_cancellation_request}}.tcr_task_id = {{%spare_parts}}.task_id')
                    ->asArray()
                    ->all();
---
SELECT `task_parts_id` FROM `dp_spare_parts` WHERE `task_order_id`='231' GROUP BY `task_parts_id`
SELECT `dp_spare_parts`.*, `dp_task_cancellation_request`.* FROM `dp_spare_parts` LEFT JOIN `dp_task_cancellation_request` ON `dp_task_cancellation_request`.tcr_task_id = `dp_spare_parts`.task_id WHERE ((`task_order_id`='231') AND (`task_parts_id`='D2017040212442514-01')) AND (`task_status` IN (103, 105, 104, 106, 110, 108, 111, 102))

                        $task['offer'] = $offers;
                        //获取任务对应的最终文件
                        $FinalFileUploadmodel = new FinalFileUpload();
                        $finalfiles = $FinalFileUploadmodel->find()
                            ->where(
                                [
                                    'fin_task_id' => $task['task_id'],
                                    'fin_examine_status' => 100
                                ]
                            )
                            ->asArray()
                            ->all();
                        $task['finalfiles'] = $finalfiles;
                        //获取任务是否提出退款扣款申请
                        $debitrefund = Debitrefund::find()
                            ->where(
                                [
                                    'debitrefund_task_id' => $task['task_id']
                                ]
                            )
                            ->asArray()
                            ->one();
---
SELECT * FROM `dp_final_file_upload` WHERE (`fin_task_id`='50') AND (`fin_examine_status`=100)
SELECT * FROM `dp_debitrefund` WHERE `debitrefund_task_id`='50'

        }
        //获取雇主上传接口上传文件信息
        $DemandReleaseFilemodel = new DemandReleaseFile();
        $DemandReleaseFiles = $DemandReleaseFilemodel->find()
            ->where(['drf_order_number' => $results['order_number']])
            ->asArray()
            ->all();
---
SELECT * FROM `dp_demand_release_file` WHERE `drf_order_number`='D2017040212442514'