models/Pay.php

    public static function alipay($order_id, $PayTypeSelect = '')
    {
        $order = Order::find()->where(['order_id' => $order_id, 'order_employer_id' => yii::$app->employer->id])->asArray()->one();
        $SparePartsmodel = new SpareParts();
        $tasks = $SparePartsmodel->find()
            ->where(['task_order_id' => $order_id, 'task_status' => 102])
            ->asArray()
            ->all();
---
SELECT * FROM `dp_order` WHERE (`order_id`='231') AND (`order_employer_id`='72')
SELECT * FROM `dp_spare_parts` WHERE (`task_order_id`='231') AND (`task_status`=102)

    public static function balancepay($order_id)
    {
        $order = Order::find()->where(['order_id' => $order_id, 'order_employer_id' => yii::$app->employer->id])->asArray()->one();
        if (in_array($order['order_status'], [103, 104])) {
            return ['status' => 101];
        }
        $employer = Employer::find()
            ->where(
                ['id' => yii::$app->employer->id]
            )
            ->asArray()
            ->one();
---
SELECT * FROM `dp_employer` WHERE `id`='72'
SELECT * FROM `dp_order` WHERE (`order_id`='231') AND (`order_employer_id`='72')