models/Visit.php

SELECT * FROM `dp_visit` WHERE `visit_ip`='127.0.0.1'
---
    public static function ExitVisit()
    {
        $visit_vip = yii::$app->request->userIP;
        $visit_url = yii::$app->request->url;
        if(!self::findOne(['visit_ip' => $visit_vip])){